# Задача №38
# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

data = 'абв вба абвгд ыбва фываыб'
print('Исходный данные:',data)